2023/实测Redis吞吐量/2_cores_bench.txt
====== PING_INLINE ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.00% <= 0.1 milliseconds
0.11% <= 0.2 milliseconds
78.03% <= 0.3 milliseconds
78.74% <= 0.4 milliseconds
81.57% <= 0.5 milliseconds
94.94% <= 0.6 milliseconds
97.35% <= 0.7 milliseconds
99.15% <= 0.8 milliseconds
99.43% <= 0.9 milliseconds
99.60% <= 1.0 milliseconds
99.87% <= 1.1 milliseconds
99.90% <= 1.2 milliseconds
99.93% <= 1.3 milliseconds
99.96% <= 1.4 milliseconds
99.99% <= 1.5 milliseconds
100.00% <= 1.6 milliseconds
100.00% <= 1.7 milliseconds
100.00% <= 1.8 milliseconds
100603.62 requests per second

====== PING_BULK ======
  100000 requests completed in 1.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.00% <= 0.1 milliseconds
0.09% <= 0.2 milliseconds
89.88% <= 0.3 milliseconds
95.02% <= 0.4 milliseconds
97.46% <= 0.5 milliseconds
99.20% <= 0.6 milliseconds
99.68% <= 0.7 milliseconds
99.83% <= 0.8 milliseconds
99.89% <= 0.9 milliseconds
99.92% <= 1.0 milliseconds
99.95% <= 1.1 milliseconds
99.95% <= 1.2 milliseconds
99.96% <= 1.3 milliseconds
99.97% <= 1.4 milliseconds
99.99% <= 1.5 milliseconds
100.00% <= 1.5 milliseconds
99800.40 requests per second

====== SET ======
  100000 requests completed in 1.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.00% <= 0.1 milliseconds
0.06% <= 0.2 milliseconds
91.06% <= 0.3 milliseconds
96.67% <= 0.4 milliseconds
97.89% <= 0.5 milliseconds
98.98% <= 0.6 milliseconds
99.50% <= 0.7 milliseconds
99.76% <= 0.8 milliseconds
99.85% <= 0.9 milliseconds
99.92% <= 1.0 milliseconds
99.93% <= 1.1 milliseconds
99.93% <= 1.2 milliseconds
99.96% <= 1.3 milliseconds
99.96% <= 1.4 milliseconds
99.97% <= 1.5 milliseconds
99.99% <= 1.6 milliseconds
100.00% <= 1.6 milliseconds
100200.40 requests per second

====== GET ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.00% <= 0.1 milliseconds
0.18% <= 0.2 milliseconds
92.35% <= 0.3 milliseconds
96.38% <= 0.4 milliseconds
98.08% <= 0.5 milliseconds
99.09% <= 0.6 milliseconds
99.40% <= 0.7 milliseconds
99.57% <= 0.8 milliseconds
99.66% <= 0.9 milliseconds
99.72% <= 1.0 milliseconds
99.78% <= 1.1 milliseconds
99.81% <= 1.2 milliseconds
99.83% <= 1.3 milliseconds
99.84% <= 1.4 milliseconds
99.85% <= 1.5 milliseconds
99.86% <= 1.6 milliseconds
99.90% <= 1.7 milliseconds
99.90% <= 1.8 milliseconds
99.92% <= 1.9 milliseconds
99.94% <= 2 milliseconds
99.96% <= 3 milliseconds
100.00% <= 3 milliseconds
101522.84 requests per second

====== INCR ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.80% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
100603.62 requests per second

====== LPUSH ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.64% <= 1 milliseconds
99.95% <= 2 milliseconds
100.00% <= 2 milliseconds
101522.84 requests per second

====== RPUSH ======
  100000 requests completed in 0.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.67% <= 1 milliseconds
99.96% <= 2 milliseconds
100.00% <= 2 milliseconds
101729.40 requests per second

====== LPOP ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.65% <= 1 milliseconds
99.97% <= 2 milliseconds
100.00% <= 2 milliseconds
100806.45 requests per second

====== RPOP ======
  100000 requests completed in 1.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.58% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
99009.90 requests per second

====== SADD ======
  100000 requests completed in 0.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.71% <= 1 milliseconds
99.93% <= 2 milliseconds
99.98% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
101936.80 requests per second

====== HSET ======
  100000 requests completed in 1.15 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

97.93% <= 1 milliseconds
100.00% <= 1 milliseconds
87183.96 requests per second

====== SPOP ======
  100000 requests completed in 1.25 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

98.53% <= 1 milliseconds
99.93% <= 2 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
80000.00 requests per second

====== ZADD ======
  100000 requests completed in 0.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.62% <= 1 milliseconds
100.00% <= 1 milliseconds
102669.41 requests per second

====== ZPOPMIN ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.51% <= 1 milliseconds
99.95% <= 2 milliseconds
100.00% <= 2 milliseconds
100908.17 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 0.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

99.70% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
101522.84 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

93.28% <= 1 milliseconds
99.91% <= 2 milliseconds
99.95% <= 3 milliseconds
99.96% <= 4 milliseconds
99.99% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
62073.25 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 3.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

70.04% <= 1 milliseconds
99.02% <= 2 milliseconds
99.94% <= 3 milliseconds
99.98% <= 4 milliseconds
100.00% <= 4 milliseconds
31250.00 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.00 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.05% <= 1 milliseconds
47.49% <= 2 milliseconds
99.94% <= 3 milliseconds
100.00% <= 3 milliseconds
19996.00 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

0.01% <= 1 milliseconds
12.29% <= 2 milliseconds
94.95% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 4 milliseconds
16396.13 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 900 1 300 10 60 10000
  host configuration "appendonly": no
  multi-thread: yes
  threads: 2

98.97% <= 1 milliseconds
100.00% <= 1 milliseconds
90661.83 requests per second